# Дана программа для исполнителя Редактор:
# ПОКА нашлось(42) или нашлось(32)
#    ЕСЛИ нашлось(42)
#       ТО заменить(42, 51)
#    ИНАЧЕ заменить(32, 61)
# КОНЕЦ ПОКА
# На вход программе подана строка, содержащая только 20 двоек, 15 троек и 10 четверок.
# Порядок символов заранее неизвестен. Определите максимально возможную сумму всех цифр в конечной строке.


s = '32' * 15 + '42' * 5 + '4' * 5
# print(s.count('3'), s.count('2'), s.count('4'))


