# Даны два целых числа.
# Выведите значение наименьшего из них.
x = int(input())
l = int(input())
if x > l:
    print(l)
else:
    print(x)