# Дан список чисел. Выведите все элементы списка, которые больше предыдущего элемента.

# a = [int(i) for i in input().split()]
#
#
# for i in range(1, len(a)):
#     if a[i] > a[i - 1]:
#         print(a[i])


a = ["1", "2", "3"]
b = "---".join(a)
print(b)