# НАЧАЛО
# ПОКА нашлось(01) ИЛИ нашлось(02) ИЛИ нашлось(03)
#   заменить(01, 30)
#   заменить(02, 3103)
#   заменить(03, 1201)
# КОНЕЦ ПОКА
# КОНЕЦ
# Известно, что исходная строка начиналась с нуля, а далее содержала только единицы, двойки и тройки.
# После выполнения данной программы получилась строка, содержащая 42 единицы, 31 двойку и 59 троек.
# Сколько двоек было в исходной строке?

for i in range(0, 50):
    for a in range(0, 50):
        for b in range(0, 50):
            s = "0" + "1" * i + "2" * a + "3" * b
            while "01" in s or "02" in s or "03" in s:
                if "01" in s:
                    s = s.replace("01", "30", 1)
                if "02" in s:
                    s = s.replace("02", "3103", 1)
                if "03" in s:
                    s = s.replace("03", "1201", 1)
            if s.count("1") == 42 and s.count("2") == 31 and s.count("3") == 59:
                print(i, a, b)










# for i in range(1, 50):
#     for a in range(1, 20):
#         for b in range(1, 50):
#             s = "0" + "1" * i + "2" * a + "3" * b
#             while "01" in s or "02" in s or "03" in s:
#                 if "01" in s:
#                     s = s.replace("01", "30", 1)
#                 if "02" in s:
#                     s = s.replace("02", "3103", 1)
#                 if "03" in s:
#                     s = s.replace("03", "1201", 1)
#             if s.count("1") == 42 and s.count("2") == 31 and s.count("3") == 59:
#                 print(a)
#                 break
