# Все 5-буквенные слова, составленные из букв Д, К, М, О, записаны в алфавитном порядке и пронумерованы.
# Вот начало списка:
# 1. ДДДДД
# 2. ДДДДК
# 3. ДДДДМ
# 4. ДДДДО
# 5. ДДДКД
# ...
# Какое количество слов находятся между словами ДОМОК и КОМОД (включая эти слова)?


# import itertools
#
# a = 'ДКМО'
# b = set(itertools.product(a, repeat=5))
#
# print(b)

print(int("33333", 4))