# Определите количество принадлежащих отрезку [2 · 1010; 4 · 1010] которые делятся на 7 и на
# 100000 и при этом не делятся на 13, 29, 43 и 101

count = 0

for i in range(2 * 10 ** 5, 4 * 10 ** 5 + 1):
    if i % 7 == 0 and i % 13 != 0 and i % 29 != 0 and i % 43 != 0 and i % 101 != 0:
        print(i * 10 ** 5)
        break
print(count)

