# Определите, сколько символов * выведет эта процедура при вызове F(40)

def F(n):
    global f
    f += 1
    if n >= 1:
        f += 1
        F(n-1)
        F(n-3)
        f += 1


f = 0
F(40)
print(f)

# 22947841
# 22947841