# Напишите программу, которая считывает целое число и выводит текст, аналогичный
# приведенному в примере (пробелы важны!).
a = int(input())
k = a + 1
l = a - 1
print('The next number for the number', a, 'is', k)
print('The previous number for the number', a, 'is', l)