# Напишите программу, которая приветствует пользователя, выводя слово Hello, введенное имя и знаки препинания по образцу:
a = input()
print('Hello, ' + a + '!')