# Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь. Каждое число записано в отдельной строке.
b = int(input())
h = int(input())
s = b * h / 2
print(s)