# Сколько единиц в двоичной записи числа 8**2018 – 4**1305 + 2**124 – 58

print(bin(8**2018 - 4**1305 + 2**124 - 58)[2:].count("1"))